In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df=pd.DataFrame([100,150,200,250,300],columns=['numbers'],
               index=['a','b','c','d','e'])

In [5]:
df.sum()

numbers    1000
dtype: int64

In [7]:
df.numbers**2

a    10000
b    22500
c    40000
d    62500
e    90000
Name: numbers, dtype: int64

In [8]:
df['values']=(10,50,40,30,60)

In [9]:
df

   numbers  values
a      100      10
b      150      50
c      200      40
d      250      30
e      300      60

In [10]:
df['values']=pd.DataFrame(['Fourth','Second','First','Firth','Third'],
                         index=['d','b','a','e','c'])

In [11]:
df

   numbers  values
a      100   First
b      150  Second
c      200   Third
d      250  Fourth
e      300   Firth

In [12]:
del df['values']

In [13]:
df

   numbers
a      100
b      150
c      200
d      250
e      300

In [15]:
df_1=pd.DataFrame(['1','2','3'],columns=['A'])

In [16]:
df_2=pd.DataFrame(['4','5','6','7'],columns=['B'])

In [17]:
df=df_1.join(df_2,how='outer')

In [18]:
df

     A  B
0    1  4
1    2  5
2    3  6
3  NaN  7

In [19]:
df=pd.DataFrame(np.random.randn(5,5))
df.colunms=['A','B','C','D','E']
df

<ipython-input-19-550e2596ec1f>:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.colunms=['A','B','C','D','E']

          0         1         2         3         4
0 -0.460721 -0.592750 -1.879733  0.030214  0.245996
1 -0.249887  2.055608 -2.380916  0.306526  0.031954
2 -0.972327 -1.418247 -0.540567 -0.366661  0.886335
3 -0.800887 -1.578549  0.804857 -0.329929 -0.120059
4  2.709184  0.750569  0.135691  1.691282  0.378636

In [21]:
df.max()

0   -0.972327
1   -1.578549
2   -2.380916
3   -0.366661
4   -0.120059
dtype: float64

In [22]:
df.min()

0   -0.972327
1   -1.578549
2   -2.380916
3   -0.366661
4   -0.120059
dtype: float64

In [23]:
df.mean()

0    0.045072
1   -0.156674
2   -0.772134
3    0.266286
4    0.284573
dtype: float64

In [24]:
df.std()

0    1.515839
1    1.542785
2    1.339741
3    0.843217
4    0.387297
dtype: float64

In [25]:
df.cumsum()

          0         1         2         3         4
0 -0.460721 -0.592750 -1.879733  0.030214  0.245996
1 -0.710609  1.462857 -4.260649  0.336740  0.277950
2 -1.682936  0.044610 -4.801216 -0.029921  1.164286
3 -2.483823 -1.533939 -3.996360 -0.359850  1.044227
4  0.225360 -0.783370 -3.860669  1.331432  1.422863

In [26]:
df.describe()

              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.045072 -0.156674 -0.772134  0.266286  0.284573
std    1.515839  1.542785  1.339741  0.843217  0.387297
min   -0.972327 -1.578549 -2.380916 -0.366661 -0.120059
25%   -0.800887 -1.418247 -1.879733 -0.329929  0.031954
50%   -0.460721 -0.592750 -0.540567  0.030214  0.245996
75%   -0.249887  0.750569  0.135691  0.306526  0.378636
max    2.709184  2.055608  0.804857  1.691282  0.886335

In [28]:
df['division']=['X','Y','X','Y','Z']
df

          0         1         2         3         4 division
0 -0.460721 -0.592750 -1.879733  0.030214  0.245996        X
1 -0.249887  2.055608 -2.380916  0.306526  0.031954        Y
2 -0.972327 -1.418247 -0.540567 -0.366661  0.886335        X
3 -0.800887 -1.578549  0.804857 -0.329929 -0.120059        Y
4  2.709184  0.750569  0.135691  1.691282  0.378636        Z

In [30]:
df.groupby(['division']).mean()

                 0         1         2         3         4
division
X        -0.716524 -1.005499 -1.210150 -0.168224  0.566166
Y        -0.525387  0.238529 -0.788030 -0.011702 -0.044052
Z         2.709184  0.750569  0.135691  1.691282  0.378636